**<운영방침>**
- 회비 : 1회 10,000원 (1인당 7회)
  - 각 회차별 사용내역은 투명하게 공개 예정
  - 운영되고 남는 금액들은 모든 스터디 마무리 회식비로 쓰여질 예정
- 무단 지각 4회 / 무단 결석 2회 이상 스터디 참여할 의사가 없다고 판단, 스터디 그룹에서 제외
- 스터디 시간 매주 일요일 19:00 ~ 21:00
- 스터디 장소는 매주 공지 예정
- 스터디 진행 내역은 매주 Git으로 관리
- 준비물 
	- 안드로이드 스튜디오가 설치된 노트북
	- 안드로이드 디바이스 (없을 경우 에뮬레이터 다운로드 필수)
	- USB 케이블



**<스터디목표>**
- 실무에서 많이 사용되고 있는 기술들을 직접 코딩해보고, 추가적인 실무 노하우 공유



**<프로젝트 진행 주제>**
- 디바이스 내에 있는 노래들을 특정 노래방 번호와 매칭하여 보여주는 앱
  (일반 사용자가 만들어 놓은 json 파일 사용 예정)



**<주차별 진행 내용>**
1주차 : 오리엔테이션 및 프로젝트 진행 주제 선정
2주차 : 1주차때 지정한 프로젝트 진행 주제의 1차 기획 내용 공유 및 Github 사용 방식과 git 연동 프로젝트 생성
3주차 ~ 7주차 : 2주차 기획을 토대로 개발 진행 (JAVA) 
	>> 하위 라이브러리 사용하여 진행
	- DataBinding
	- Retrofit2
	- Room
	- MVVM
	- RxJava(도 가능하다면..)
	(시간 괜찮다면 일부 Kotlin으로 변환 진행)
8주차(마지막) : 코드 리뷰 및 회고 (후 회식!)

